In [7]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3': ['abc','def','ghi','xyz']})

In [17]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [21]:
df['col2'].nunique()

3

In [23]:
 df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [25]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [27]:
newdf

   col1  col2 col3
3     4   444  xyz

In [31]:
def times2(x):
 return x*2

In [33]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [35]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [37]:
df['col1'].sum()

10

In [39]:
del df['col1']

In [41]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [43]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [45]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [47]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [49]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [51]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [53]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [55]:
import numpy as np

In [57]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
'col2':[np.nan,555,666,444],
'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [59]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [69]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
 'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [71]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [73]:
 df.pivot_table(values='D',index=['A', 'B'],columns=['C'])
# Explain what is going on here!!!

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN